//
//                #####################################################
//                #                                                   #
//                #                       _oo0oo_                     #
//                #                      o8888888o                    #
//                #                      88" . "88                    #
//                #                      (| -_- |)                    #
//                #                      0\  =  /0                    #
//                #                    ___/`---'\___                  #
//                #                  .' \\|     |# '.                 #
//                #                 / \\|||  :  |||# \                #
//                #                / _||||| -:- |||||- \              #
//                #               |   | \\\  -  #/ |   |              #
//                #               | \_|  ''\---/''  |_/ |             #
//                #               \  .-\__  '-'  ___/-. /             #
//                #             ___'. .'  /--.--\  `. .'___           #
//                #          ."" '<  `.___\_<|>_/___.' >' "".         #
//                #         | | :  `- \`.;`\ _ /`;.`/ - ` : | |       #
//                #         \  \ `_.   \_ __\ /__ _/   .-` /  /       #
//                #     =====`-.____`.___ \_____/___.-`___.-'=====    #
//                #                       `=---='                     #
//                #     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~   #
//                #                                                   #
//                #               佛祖保佑         永无BUG              #
//                #                                                   #
//                #####################################################
//

//  Created by 李小争 on 16/5/18.
//  Copyright © 2016年 WeiZhi. All rights reserved.
//

#import <Foundation/Foundation.h>
#import "XZBaseMacro.h"
@import UIKit;

@interface Helper : NSObject

/**
 * 检查系统"照片"授权状态, 如果权限被关闭, 提示用户去隐私设置中打开.
 */
+ (BOOL)checkPhotoLibraryAuthorizationStatus;

/**
 * 检查系统"相机"授权状态, 如果权限被关闭, 提示用户去隐私设置中打开.
 */
+ (BOOL)checkCameraAuthorizationStatus;

@end
